app/controllers/tasks_controller.rb

SELECT * FROM "tasks" WHERE ("tasks"."done" = 't') AND ("tasks".list_id = 298486374) ORDER BY updated_at DESC
SELECT * FROM "lists" ORDER BY lists.id DESC LIMIT 1
---
  def index
    @todo   = Task.all(:conditions => {:done => false})
    @task   = Task.new
    @lists  = List.all

SELECT * FROM "lists" WHERE ("lists"."id" = 1)
INSERT INTO "tasks" ("name", "created_at", "updated_at", "done", "list_id") VALUES(NULL, '2012-01-19 22:03:06', '2012-01-19 22:03:06', NULL, 298486374)
---
  def create
    @list = List.find(params[:list_id])
    @task = @list.tasks.new(params[:task])
    if @task.save

SELECT * FROM "tasks" WHERE ("tasks"."id" = 6)
DELETE FROM "tasks" WHERE "id" = 6
---
  def destroy
    @task = Task.find(params[:id])
    @task.destroy